IDENTIFICATION DIVISION.
PROGRAM-ID. TemperatureConversion.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 WS-CELSIUS PIC 999V99.
   01 WS-FAHRENHEIT PIC 999V99.

PROCEDURE DIVISION.
    DISPLAY "Enter temperature in Celsius: " WITH NO ADVANCING.
    ACCEPT WS-CELSIUS.

    COMPUTE WS-FAHRENHEIT = (WS-CELSIUS * 9 / 5) + 32.

    DISPLAY "Temperature in Fahrenheit: " WS-FAHRENHEIT.
    STOP RUN.
