IDENTIFICATION DIVISION.
PROGRAM-ID. AverageNumbers.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 WS-NUMBER PIC 9(3) OCCURS 10 TIMES.
   01 WS-SUM PIC 9(5) VALUE 0.
   01 WS-AVERAGE PIC 9(5)V9(2).
   01 WS-I
